[
  {
    "title": "akira",
    "image": "akira.jpg",
    "release_date": "1988",
    "status": "Completed",
    "type": "Action, Sci-Fi",
    "description": "In a dystopian future, biker gang member Kaneda embarks on a journey to save his friend Tetsuo from a government experiment gone wrong, uncovering dark secrets about psychic powers and military conspiracies.",
    "notes": "8.4"
  },
  {
    "title": "angel-beats",
    "image": "angel-beats.jpg",
    "release_date": "2010",
    "status": "Completed",
    "type": "Action, Comedy, Drama, Supernatural",
    "description": "In the afterlife, a group of students fights against a mysterious girl named Angel to escape their fate, only to discover the true meaning of their existence.",
    "notes": "8.2"
  },
  {
    "title": "attack-on-titan-season-2",
    "image": "attack-on-titan-season-2.jpg",
    "release_date": "2017",
    "status": "Completed",
    "type": "Action, Drama, Fantasy",
    "description": "Eren Yeager and his friends continue their battle against the Titans, uncovering shocking truths about the creatures and the walls that protect humanity.",
    "notes": "8.9"
  },
  {
    "title": "attack-on-titan-season-3",
    "image": "Attack-on-Titan-Season-3.jpg",
    "release_date": "2018",
    "status": "Completed",
    "type": "Action, Drama, Fantasy",
    "description": "The Survey Corps faces political conspiracies and hidden truths while uncovering the secrets of the Titans and the walls that enclose them.",
    "notes": "9.1"
  },
  {
    "title": "attack-on-titan",
    "image": "attack-on-titan.jpg",
    "release_date": "2013",
    "status": "Completed",
    "type": "Action, Drama, Fantasy",
    "description": "Eren Yeager joins the Survey Corps to fight against Titans after witnessing the destruction of his home, only to uncover dark secrets about their true nature.",
    "notes": "9.0"
  },
  {
    "title": "beastars",
    "image": "Beastars.jpg",
    "release_date": "2019",
    "status": "Completed",
    "type": "Drama, Psychological, Romance",
    "description": "In a world of anthropomorphic animals, a wolf named Legoshi struggles with his instincts and feelings for a small rabbit, Haru, amidst growing tension between carnivores and herbivores.",
    "notes": "7.8"
  },
  {
    "title": "black-clover",
    "image": "black-clover.jpg",
    "release_date": "2017",
    "status": "Ongoing",
    "type": "Action, Fantasy, Magic",
    "description": "Asta, a boy born without magic in a world where magic is everything, strives to become the Wizard King alongside his rival Yuno.",
    "notes": "8.0"
  },
  {
    "title": "black-lagoon",
    "image": "black-lagoon.jpg",
    "release_date": "2006",
    "status": "Completed",
    "type": "Action, Crime, Seinen",
    "description": "A businessman turned mercenary, Rock, joins the Lagoon Company, a group of outlaws operating in the crime-infested waters of Southeast Asia.",
    "notes": "8.1"
  },
  {
    "title": "bleach",
    "image": "bleach.jpg",
    "release_date": "2004",
    "status": "Completed",
    "type": "Action, Adventure, Supernatural",
    "description": "Ichigo Kurosaki, a teenager who can see ghosts, becomes a Soul Reaper to protect humanity from evil spirits known as Hollows.",
    "notes": "8.5"
  },
  {
    "title": "blue-lock",
    "image": "blue-lock_6_11zon.jpg",
    "release_date": "2022",
    "status": "Ongoing",
    "type": "Sports, Drama, Psychological",
    "description": "After Japan's disastrous World Cup performance, a radical training program called 'Blue Lock' aims to create the world's best striker through intense competition.",
    "notes": "8.3"
  },
  {
    "title": "bunny-girl-senpai",
    "image": "bunny-girl-senpai.jpg",
    "release_date": "2018",
    "status": "Completed",
    "type": "Romance, Supernatural, Drama",
    "description": "High school student Sakuta encounters a mysterious girl, Mai, dressed as a bunny girl, suffering from a phenomenon known as 'Adolescence Syndrome.' Together, they unravel its mysteries.",
    "notes": "8.4"
  },
  {
    "title": "clannad-after-story",
    "image": "clannad-after-story.jpg",
    "release_date": "2008",
    "status": "Completed",
    "type": "Drama, Romance, Slice of Life",
    "description": "Following the events of Clannad, Tomoya and Nagisa face adulthood, learning the importance of family, love, and hardships that come with growing up.",
    "notes": "9.1"
  },
  {
    "title": "cowboy-bebop",
    "image": "cowboy-bebop.jpg",
    "release_date": "1998",
    "status": "Completed",
    "type": "Action, Adventure, Sci-Fi",
    "description": "In the year 2071, bounty hunters Spike Spiegel and his crew take on criminals across the galaxy while confronting their own pasts.",
    "notes": "8.9"
  },
  {
    "title": "death-parade",
    "image": "death-parade.jpg",
    "release_date": "2015",
    "status": "Completed",
    "type": "Psychological, Thriller, Drama",
    "description": "In a mysterious bar, the recently deceased must play life-threatening games to determine their fate—reincarnation or oblivion.",
    "notes": "8.2"
  },
  {
    "title": "demon-slayer",
    "image": "demon-slayer.jpg",
    "release_date": "2019",
    "status": "Ongoing",
    "type": "Action, Adventure, Fantasy",
    "description": "Tanjiro Kamado seeks vengeance and a cure for his sister after his family is slaughtered by demons, leading him to join the Demon Slayer Corps.",
    "notes": "8.7"
  },
  {
    "title": "dorohedoro",
    "image": "dorohedoro.jpg",
    "release_date": "2020",
    "status": "Completed",
    "type": "Action, Comedy, Fantasy, Horror, Seinen",
    "description": "In a dark and gritty city known as Hole, sorcerers from another dimension experiment on its inhabitants. Caiman, a man with a lizard head, is on a mission to uncover his true identity and kill the sorcerer who cursed him. With the help of his friend Nikaido, they hunt down magic users while trying to survive the chaos of their violent world.",
    "notes": "8.1"
  },
  {
    "title": "dragon-ball-super",
    "image": "dragon-ball-super.jpg",
    "release_date": "2015",
    "status": "Completed",
    "type": "Action, Adventure, Comedy, Super Power, Martial Arts, Fantasy",
    "description": "Following the defeat of Majin Buu, Goku and his friends face new challenges as they encounter gods of destruction, powerful warriors from alternate universes, and even resurrected enemies. With the introduction of Super Saiyan God, Ultra Instinct, and new powerful adversaries, the Dragon Ball saga continues to reach new heights of intensity.",
    "notes": "7.4"
  },
  {
    "title": "elfen-lied",
    "image": "elfen-lied.jpg",
    "release_date": "2004",
    "status": "Completed",
    "type": "Action, Drama, Horror, Psychological, Supernatural",
    "description": "Lucy, a mutant with deadly telekinetic powers, escapes from a government lab, suffering from amnesia. Now with the mind of a child and a split personality, she finds shelter with two unsuspecting college students. However, as her memories return, so does her violent nature, bringing destruction and revealing a dark past of experiments and cruelty.",
    "notes": "7.5"
  },
  {
    "title": "fairy-tail",
    "image": "fairy-tail.jpg",
    "release_date": "2009",
    "status": "Completed",
    "type": "Action, Adventure, Comedy, Fantasy, Magic, Shounen",
    "description": "Lucy Heartfilia dreams of joining the famous Fairy Tail guild. After meeting Natsu Dragneel and his cat-like partner Happy, she finds herself recruited into the legendary group. Together with powerful wizards like Gray and Erza, they embark on thrilling adventures, battling dark guilds, uncovering ancient secrets, and forging unbreakable bonds.",
    "notes": "7.7"
  },
  {
    "title": "fate-stay-night-unlimited-blade-works",
    "image": "Fate-Stay-night-unlimited-blade-works.jpg",
    "release_date": "2014",
    "status": "Completed",
    "type": "Action, Fantasy, Magic, Supernatural",
    "description": "In the city of Fuyuki, a deadly battle known as the Holy Grail War takes place. Seven mages summon heroic spirits to fight for the ultimate prize. Shirou Emiya, an idealistic high school student, is dragged into the war and must fight alongside his servant Saber. As he uncovers dark secrets, he questions the true nature of heroism and sacrifice.",
    "notes": "8.2"
  },
  {
    "title": "fate-zero",
    "image": "Fate-Zero.jpg",
    "release_date": "2011",
    "status": "Completed",
    "type": "Action, Supernatural, Magic, Fantasy",
    "description": "The Fourth Holy Grail War is set in motion, with seven masters and their legendary heroic spirits vying for control of the powerful artifact. Kiritsugu Emiya, a mercenary known as the 'Magus Killer,' joins the war for his own ideals. As alliances shift and betrayals emerge, the battle for the Holy Grail takes a dark and tragic turn.",
    "notes": "8.6"
  },
  {
    "title": "fruits-basket",
    "image": "fruits-basket.jpg",
    "release_date": "2019",
    "status": "Completed",
    "type": "Drama, Romance, Supernatural",
    "description": "Tohru Honda, a kind-hearted girl, finds herself living with the mysterious Sohma family after losing her mother. She soon discovers that they are cursed: certain family members transform into animals of the Chinese Zodiac when hugged by the opposite sex. As she gets to know them, Tohru becomes determined to heal their emotional wounds and break the curse.",
    "notes": "8.9"
  },
  {
    "title": "fullmetal-alchemist-brotherhood",
    "image": "fullmetal-alchemist-brotherhood.jpg",
    "release_date": "2009",
    "status": "Completed",
    "type": "Action, Adventure, Drama, Fantasy, Magic, Military, Shounen",
    "description": "Brothers Edward and Alphonse Elric commit the forbidden act of human transmutation to bring their mother back to life. The attempt backfires, costing Edward an arm and a leg and Alphonse his entire body. To restore their bodies, they embark on a journey to find the Philosopher's Stone, facing powerful enemies and uncovering dark truths.",
    "notes": "9.1"
  },
  {
    "title": "ghost-in-the-shell",
    "image": "ghost-in-the-shell.jpg",
    "release_date": "1995",
    "status": "Completed",
    "type": "Action, Sci-Fi, Police, Psychological, Mecha, Seinen",
    "description": "In a future where cybernetic enhancements are common, Major Motoko Kusanagi leads Section 9 in hunting down cyber-criminals. When they encounter the elusive hacker known as the 'Puppet Master,' they are drawn into a web of conspiracy that challenges the very nature of identity and consciousness in a digital age.",
    "notes": "8.0"
  },
  {
    "title": "hellsing",
    "image": "hellsing.jpg",
    "release_date": "2001",
    "status": "Completed",
    "type": "Action, Horror, Supernatural, Vampire, Seinen",
    "description": "The Hellsing Organization exists to protect England from supernatural threats. Their greatest weapon is Alucard, an ancient and powerful vampire who serves the organization. Alongside Seras Victoria, a newly turned vampire, they battle against undead creatures, rival organizations, and a terrifying conspiracy seeking to plunge the world into chaos.",
    "notes": "7.6"
  },
  {
    "title": "hunter-x-hunter",
    "image": "hunter-x-hunter.jpg",
    "release_date": "2011",
    "status": "Completed",
    "type": "Action, Adventure, Fantasy, Super Power, Shounen",
    "description": "Gon Freecss dreams of becoming a Hunter, an elite individual with special privileges and access to unexplored parts of the world. As he trains for the Hunter Exam, he befriends Killua, Leorio, and Kurapika. Together, they face formidable challenges, dangerous enemies, and thrilling adventures in pursuit of their personal goals.",
    "notes": "9.0"
  },
  {
    "title": "Hyouka",
    "image": "hyouka.jpg",
    "release_date": "2012",
    "status": "Completed",
    "type": "Mystery, Slice of Life, School",
    "description": "Houtarou Oreki, a high school student who prioritizes energy conservation, joins the Classic Literature Club at his sister's request. Alongside the curious Eru Chitanda and his friends, he begins solving small mysteries surrounding the club and their school, leading to unexpected discoveries.",
    "notes": "8.1"
  },
  {
    "title": "Jojo's Bizarre Adventure",
    "image": "jojo's-bizzare-adventure.jpg",
    "release_date": "2012",
    "status": "Ongoing",
    "type": "Action, Adventure, Supernatural",
    "description": "The Joestar family is destined to battle against supernatural foes over generations. From the rivalry between Jonathan Joestar and Dio Brando to the Stand battles of later descendants, this series is a thrilling ride through time, adventure, and bizarre abilities.",
    "notes": "8.4"
  },
  {
    "title": "K-On!",
    "image": "K-On!_1_11zon.jpg",
    "release_date": "2009",
    "status": "Completed",
    "type": "Music, Comedy, School, Slice of Life",
    "description": "A group of high school girls forms the Light Music Club to save it from disbandment. Despite their initial lack of skill, they grow together through friendship and music, leading to heartwarming and humorous moments.",
    "notes": "7.8"
  },
  {
    "title": "Kaguya-sama: Love is War",
    "image": "kaguya-sama--love-is-war.jpg",
    "release_date": "2019",
    "status": "Completed",
    "type": "Comedy, Psychological, Romance, School",
    "description": "At Shuchiin Academy, student council members Miyuki Shirogane and Kaguya Shinomiya are too proud to confess their love for each other. Instead, they engage in hilarious psychological battles, trying to make the other confess first.",
    "notes": "8.5"
  },
  {
    "title": "Made in Abyss",
    "image": "made-in-abyss.jpg",
    "release_date": "2017",
    "status": "Ongoing",
    "type": "Adventure, Drama, Fantasy",
    "description": "Riko, a young cave raider, dreams of exploring the Abyss, a massive chasm filled with mysterious relics and creatures. When she meets Reg, a robotic boy, they embark on a perilous journey to uncover the secrets of the Abyss and find her missing mother.",
    "notes": "8.7"
  },
  {
    "title": "March Comes in Like a Lion",
    "image": "march-comes-in-like-a-lion.jpg",
    "release_date": "2016",
    "status": "Completed",
    "type": "Drama, Slice of Life, Seinen",
    "description": "Rei Kiriyama, a young professional shogi player, struggles with loneliness and past trauma. Through his interactions with a warm-hearted family, he gradually finds meaning and emotional growth in both his personal and professional life.",
    "notes": "8.6"
  },
  {
    "title": "Mob Psycho 100",
    "image": "mob-psycho-100.jpg",
    "release_date": "2016",
    "status": "Completed",
    "type": "Action, Comedy, Supernatural",
    "description": "Shigeo Kageyama, also known as 'Mob,' is a psychic who suppresses his emotions to control his immense powers. As he navigates daily life and faces supernatural threats, he learns valuable lessons about strength, emotions, and self-worth.",
    "notes": "8.6"
  },
  {
    "title": "Mushoku Tensei: Jobless Reincarnation",
    "image": "mushoku-tensei-jobless-reincarnation.jpg",
    "release_date": "2021",
    "status": "Ongoing",
    "type": "Adventure, Drama, Fantasy",
    "description": "A jobless and hopeless man dies and is reincarnated in a magical world as Rudeus Greyrat. Determined to live a better life, he uses his intelligence and past experiences to master magic and navigate the challenges of his new world.",
    "notes": "8.8"
  },
  {
    "title": "My Hero Academia",
    "image": "my-hero-academia_1_11zon.jpg",
    "release_date": "2016",
    "status": "Ongoing",
    "type": "Action, Superhero, School",
    "description": "Izuku Midoriya dreams of becoming a hero in a world where superpowers, known as 'Quirks,' are common. After inheriting the legendary Quirk 'One For All,' he enrolls in U.A. High School to train and become a professional hero.",
    "notes": "8.2"
  },
  {
    "title": "Naruto: Shippuden",
    "image": "naruto-shippuden.jpg",
    "release_date": "2007",
    "status": "Completed",
    "type": "Action, Adventure, Supernatural",
    "description": "Years after leaving Konoha, Naruto Uzumaki returns stronger and more determined than ever to save his friend Sasuke and protect the ninja world from looming threats.",
    "notes": "8.6"
  },
  {
    "title": "Naruto",
    "image": "naruto.jpg",
    "release_date": "2002",
    "status": "Completed",
    "type": "Action, Adventure, Supernatural",
    "description": "Naruto Uzumaki, a mischievous ninja, dreams of becoming the Hokage, the strongest ninja in his village. With his friends and mentors, he embarks on adventures that test his will, courage, and friendships.",
    "notes": "8.0"
  },
  {
    "title": "Neon Genesis Evangelion",
    "image": "neon-genesis-evangelion.jpg",
    "release_date": "1995",
    "status": "Completed",
    "type": "Action, Drama, Psychological, Mecha",
    "description": "In a post-apocalyptic world, teenagers are chosen to pilot giant mechs called EVA Units to protect humanity from mysterious beings known as Angels. As the battle intensifies, the pilots face psychological trauma and existential dilemmas.",
    "notes": "8.5"
  },
  {
    "title": "No Game No Life",
    "image": "no-game-no-life.jpg",
    "release_date": "2014",
    "status": "Completed",
    "type": "Adventure, Comedy, Fantasy, Supernatural",
    "description": "Sora and Shiro, genius gamer siblings, are transported to a world where games decide everything. Using their intellect, they aim to conquer this world and challenge its god to a final game.",
    "notes": "8.1"
  },
  {
    "title": "Nodame Cantabile",
    "image": "nodame-cantabile.jpg",
    "release_date": "2007",
    "status": "Completed",
    "type": "Comedy, Drama, Music, Romance",
    "description": "Chiaki, a perfectionist pianist, meets the eccentric yet talented Nodame, who changes his perspective on music and life. Their relationship develops through humor, music, and personal growth.",
    "notes": "8.2"
  },
  {
    "title": "Noragami",
    "image": "noragami.jpg",
    "release_date": "2014",
    "status": "Completed",
    "type": "Action, Supernatural, Comedy",
    "description": "Yato, a minor god, dreams of gaining millions of followers. Alongside his spirit weapon Yukine and the human girl Hiyori, he takes on odd jobs while battling spirits and facing his past.",
    "notes": "8.0"
  },
  {
    "title": "One Piece",
    "image": "one-piece.jpg",
    "release_date": "1999",
    "status": "Ongoing",
    "type": "Action, Adventure, Fantasy",
    "description": "Monkey D. Luffy sets sail with his crew, the Straw Hat Pirates, in search of the legendary One Piece treasure to become the Pirate King.",
    "notes": "8.7"
  },
  {
    "title": "One Punch Man",
    "image": "one-punch-man_2_11zon.jpg",
    "release_date": "2015",
    "status": "Completed",
    "type": "Action, Comedy, Superhero",
    "description": "Saitama, a hero who can defeat any opponent with a single punch, struggles with boredom and seeks a worthy challenge in a world of heroes and monsters.",
    "notes": "8.5"
  },
  {
    "title": "Re:Zero - Starting Life in Another World",
    "image": "re-zero-starting-life-in-another-world_3_11zon.jpg",
    "release_date": "2016",
    "status": "Ongoing",
    "type": "Adventure, Drama, Fantasy",
    "description": "Subaru Natsuki is transported to a fantasy world where he discovers he has the ability to return to a previous point upon death, leading him to uncover mysteries and face brutal trials.",
    "notes": "8.3"
  },
  {
    "title": "Samurai Champloo",
    "image": "samurai-champloo.jpg",
    "release_date": "2004",
    "status": "Completed",
    "type": "Action, Adventure, Samurai",
    "description": "Three strangers—a wild swordsman, a ronin, and a waitress—embark on a journey to find the 'samurai who smells of sunflowers,' facing enemies and adventures along the way.",
    "notes": "8.5"
  },
  {
    "title": "Spice and Wolf",
    "image": "spice-and-wolf.jpg",
    "release_date": "2008",
    "status": "Completed",
    "type": "Adventure, Fantasy, Romance",
    "description": "A traveling merchant, Kraft Lawrence, teams up with Holo, a wise wolf deity, to navigate trade, economics, and their growing companionship.",
    "notes": "8.2"
  },
  {
    "title": "Steins;Gate",
    "image": "steins-gate.jpg",
    "release_date": "2011",
    "status": "Completed",
    "type": "Sci-Fi, Thriller",
    "description": "A self-proclaimed mad scientist, Rintarou Okabe, stumbles upon a way to alter time, leading to unintended consequences that threaten his friends and reality itself.",
    "notes": "9.0"
  },
  {
    "title": "Sword Art Online: Alicization",
    "image": "sword-art-online-alicization.jpg",
    "release_date": "2018",
    "status": "Completed",
    "type": "Action, Adventure, Fantasy",
    "description": "Kirito wakes up in a mysterious virtual world called Underworld, where he must uncover secrets and face new challenges alongside Eugeo and Alice.",
    "notes": "7.6"
  },
  {
    "title": "Sword Art Online",
    "image": "sword-art-online.jpg",
    "release_date": "2012",
    "status": "Completed",
    "type": "Action, Adventure, Fantasy",
    "description": "Players of the virtual reality MMORPG 'Sword Art Online' find themselves trapped, with death in the game meaning death in real life. Kirito fights to escape and protect his friends.",
    "notes": "7.7"
  },
  {
    "title": "The Promised Neverland",
    "image": "the-promised-neverland.jpg",
    "release_date": "2019",
    "status": "Completed",
    "type": "Mystery, Thriller, Horror",
    "description": "A group of orphans living in a seemingly perfect home discover a dark secret and plan their escape from the horrifying fate awaiting them.",
    "notes": "8.5"
  },
  {
    "title": "The Rising of the Shield Hero",
    "image": "the-rising-of-the-shield-hero.jpg",
    "release_date": "2019",
    "status": "Ongoing",
    "type": "Action, Adventure, Fantasy",
    "description": "Naofumi Iwatani is transported to another world as the Shield Hero, only to be betrayed and forced to rebuild his reputation while fighting waves of monstrous threats.",
    "notes": "8.0"
  },
  {
    "title": "The Seven Deadly Sins",
    "image": "the-seven-deadly-sins_4_11zon.jpg",
    "release_date": "2014",
    "status": "Completed",
    "type": "Action, Adventure, Fantasy",
    "description": "Princess Elizabeth searches for the legendary Seven Deadly Sins, a group of exiled knights, to save her kingdom from tyranny.",
    "notes": "7.8"
  },
  {
    "title": "Tokyo Ghoul",
    "image": "tokyo-ghoul.jpg",
    "release_date": "2014",
    "status": "Completed",
    "type": "Action, Horror, Supernatural",
    "description": "Ken Kaneki, a college student, is turned into a half-ghoul after an encounter with a monstrous being. He must navigate his new life while struggling between his human and ghoul identities.",
    "notes": "7.9"
  },
  {
    "title": "Tokyo Revengers",
    "image": "tokyo-revenger_5_11zon.jpg",
    "release_date": "2021",
    "status": "Ongoing",
    "type": "Action, Drama, Time Travel",
    "description": "Takemichi Hanagaki discovers he can travel back in time and tries to change the past to save his childhood love and alter the fate of the Tokyo Manji Gang.",
    "notes": "7.9"
  },
  {
    "title": "Toradora!",
    "image": "toradora.jpg",
    "release_date": "2008",
    "status": "Completed",
    "type": "Comedy, Romance, School",
    "description": "Ryuji Takasu and Taiga Aisaka, despite their differences, form an alliance to help each other confess to their crushes, leading to unexpected emotions.",
    "notes": "8.0"
  },
  {
    "title": "Trigun",
    "image": "trigun.jpg",
    "release_date": "1998",
    "status": "Completed",
    "type": "Action, Adventure, Sci-Fi",
    "description": "Vash the Stampede, a legendary outlaw with a massive bounty, travels a desert wasteland while trying to uphold his pacifist ideals and uncover his past.",
    "notes": "8.3"
  },
  {
    "title": "Vinland Saga",
    "image": "vinland-saga.jpg",
    "release_date": "2019",
    "status": "Ongoing",
    "type": "Action, Adventure, Historical",
    "description": "Thorfinn, a young Viking warrior, seeks revenge against Askeladd for his father's death while navigating the brutal world of Norse warriors.",
    "notes": "8.8"
  },
  {
    "title": "Your Name",
    "image": "your-name.jpg",
    "release_date": "2016",
    "status": "Completed",
    "type": "Drama, Romance, Supernatural",
    "description": "A boy and a girl from different places mysteriously swap bodies, leading them to form a deep connection and unravel a destiny-changing event.",
    "notes": "8.9"
  },
  {
    "title": "Yuri on Ice",
    "image": "yuri-on-ice.jpg",
    "release_date": "2016",
    "status": "Completed",
    "type": "Sports, Drama, Romance",
    "description": "Yuri Katsuki, a struggling figure skater, finds guidance and inspiration from his idol, Victor Nikiforov, as he competes in the international arena.",
    "notes": "8.1"
  }
]
