[
    {
      "title": "naruto",
      "image": "naruto",
      "release_date": "2002-10-03",
      "status": "Completed",
      "type": "Action, Adventure, Martial Arts",
      "description":
        "A young ninja, Naruto Uzumaki, strives to become the strongest Hokage while dealing with his dark past.",
      "notes": "8.3"
    },
    {
      "title": "one-piece",
      "image": "one-piece",
      "release_date": "1999-10-20",
      "status": "Ongoing",
      "type": "Action, Adventure, Fantasy",
      "description":
        "Monkey D. Luffy sets sail with his pirate crew to find the legendary One Piece treasure.",
      "notes": "9.0"
    },
    {
      "title": "attack-on-titan",
      "image": "attack-on-titan",
      "release_date": "2013-04-07",
      "status": "Completed",
      "type": "Action, Drama, Fantasy",
      "description":
        "Humanity fights for survival against giant humanoid creatures known as Titans.",
      "notes": "9.1"
    },
    {
      "title": "dragon-ball-z",
      "image": "dragon-ball-z",
      "release_date": "1989-04-26",
      "status": "Completed",
      "type": "Action, Adventure, Martial Arts",
      "description":
        "Goku and his friends battle powerful enemies to protect Earth and the universe.",
      "notes": "8.7"
    },
    {
      "title": "my-hero-academia",
      "image": "my-hero-academia",
      "release_date": "2016-04-03",
      "status": "Ongoing",
      "type": "Action, Superhero, School",
      "description":
        "A boy born without superpowers aims to become the greatest hero in a world where almost everyone has abilities.",
      "notes": "8.4"
    },
    {
      "title": "death-note",
      "image": "death-note",
      "release_date": "2006-10-04",
      "status": "Completed",
      "type": "Psychological, Thriller, Supernatural",
      "description":
        "A high school student gains a notebook that lets him kill anyone by writing their name in it.",
      "notes": "9.0"
    },
    {
      "title": "fullmetal-alchemist-brotherhood",
      "image": "fullmetal-alchemist-brotherhood",
      "release_date": "2009-04-05",
      "status": "Completed",
      "type": "Action, Adventure, Fantasy",
      "description":
        "Two brothers search for the Philosopher's Stone after an alchemy experiment goes wrong.",
      "notes": "9.1"
    },
    {
        "title": "naruto-shippuden",
        "image": "naruto-shippuden",
        "release_date": "2007-02-15",
        "status": "Completed",
        "type": "Action",
        "description": "Naruto: Shippuden continues the journey of Naruto Uzumaki, a young ninja with the dream of becoming the Hokage, the strongest ninja in his village. After training for two and a half years with Jiraiya, Naruto returns to the Hidden Leaf Village to reunite with his friends and continue his quest to bring back his lost comrade, Sasuke Uchiha. However, dark forces are rising as the criminal organization Akatsuki begins to make their move, seeking to capture the tailed beasts, including Naruto's Nine-Tails. The series explores themes of friendship, perseverance, and the struggles of war as Naruto faces powerful enemies and learns the truth about his past.",
        "notes": "8.7"
    },
    {
     "title": "naruto",
      "image": "naruto",
      "release_date": "2002-10-03",
      "status": "Completed",
      "type": "Action, Adventure, Martial Arts",
      "description":
        "Naruto Uzumaki, a young ninja, dreams of becoming the Hokage, the strongest ninja and leader of his village. However, he is shunned by the villagers because he carries the Nine-Tails Fox, a powerful beast that attacked the Hidden Leaf Village years ago. Determined to prove himself, Naruto embarks on a journey to gain strength, form deep friendships, and confront dark organizations like the Akatsuki. As he learns the true meaning of being a ninja, he must face personal loss, fierce battles, and his destiny as the child of prophecy.",
      "notes": "8.3"
    },
    {
      "title": "one-piece",
      "image": "one-piece",
      "release_date": "1999-10-20",
      "status": "Ongoing",
      "type": "Action, Adventure, Fantasy",
      "description":
        "Monkey D. Luffy sets out on an epic journey to become the Pirate King by finding the legendary treasure, the One Piece. With his rubber-like abilities gained from the Gum-Gum Fruit, Luffy gathers a diverse crew known as the Straw Hat Pirates. Together, they explore dangerous seas, battle powerful foes, and uncover secrets about the world’s corrupt government, mysterious Devil Fruits, and the lost history of the Void Century. Their adventures lead them to legendary islands, fierce rivalries, and the pursuit of their dreams in the Grand Line.",
      "notes": "9.0"
    },
    {
      "title": "attack-on-titan",
      "image": "attack-on-titan",
      "release_date": "2013-04-07",
      "status": "Completed",
      "type": "Action, Drama, Fantasy",
      "description":
        "In a world where humanity is on the brink of extinction due to monstrous humanoid creatures known as Titans, Eren Yeager, his adoptive sister Mikasa, and his best friend Armin join the Survey Corps to fight back. As they uncover the shocking truth behind the Titans and their own history, they realize that their greatest enemies might not be the Titans outside the walls, but the secrets hidden within them. The story takes intense turns involving betrayal, war, and the fight for true freedom.",
      "notes": "9.1"
    },
    {
      "title": "dragon-ball-z",
      "image": "dragon-ball-z",
      "release_date": "1989-04-26",
      "status": "Completed",
      "type": "Action, Adventure, Martial Arts",
      "description":
        "Goku, a Saiyan warrior raised on Earth, discovers his alien origins and faces powerful enemies who threaten his home. Alongside his friends and family, he trains to protect the universe from devastating threats like Frieza, Cell, and Majin Buu. Through intense battles, Super Saiyan transformations, and high-stakes tournaments, Goku and his allies push their limits to defend the universe and seek ever-greater strength.",
      "notes": "8.7"
    },
    {
      "title": "my-hero-academia",
      "image": "my-hero-academia",
      "release_date": "2016-04-03",
      "status": "Ongoing",
      "type": "Action, Superhero, School",
      "description":
        "In a world where superpowers, known as 'Quirks,' are common, Izuku Midoriya is born powerless. Despite this, he dreams of becoming the greatest hero. After an encounter with his idol, All Might, he inherits the powerful Quirk 'One For All' and joins U.A. High School, a prestigious institution for young heroes. As he trains to master his abilities, he faces powerful villains, dark conspiracies, and personal struggles while striving to become the symbol of peace.",
      "notes": "8.4"
    },
    {
      "title": "death-note",
      "image": "death-note",
      "release_date": "2006-10-04",
      "status": "Completed",
      "type": "Psychological, Thriller, Supernatural",
      "description":
        "Light Yagami, a genius high school student, discovers a mysterious notebook called the Death Note, which allows him to kill anyone by writing their name in it. Determined to rid the world of criminals, he assumes the identity of 'Kira' and becomes a vigilante. However, his actions attract the attention of the world-renowned detective L, leading to a high-stakes battle of wits and morality. As Light’s ambitions grow, he finds himself entangled in a deadly game where even the smallest mistake could cost him everything.",
      "notes": "9.0"
    },
    {
      "title": "fullmetal-alchemist-brotherhood",
      "image": "fullmetal-alchemist-brotherhood",
      "release_date": "2009-04-05",
      "status": "Completed",
      "type": "Action, Adventure, Fantasy",
      "description":
        "Brothers Edward and Alphonse Elric use alchemy to try and resurrect their deceased mother, but the forbidden experiment costs Edward his arm and leg, while Alphonse loses his entire body. Determined to restore what they lost, they set out on a journey to find the Philosopher's Stone. Along the way, they uncover dark secrets about their country's government, the true nature of alchemy, and the terrifying truth behind human transmutation. Their quest becomes a fight not only to regain their bodies but also to protect the people they love.",
      "notes": "9.1"
    },
    {
      "title": "naruto-shippuden",
      "image": "naruto-shippuden",
      "release_date": "2007-02-15",
      "status": "Completed",
      "type": "Action, Adventure, Martial Arts",
      "description":
        "Two years after leaving the Hidden Leaf Village, Naruto Uzumaki returns stronger than ever. With the looming threat of the Akatsuki, an organization hunting Jinchuriki like him, Naruto and his friends must grow in power and face dangerous enemies. As he seeks to rescue his best friend Sasuke and uncover the truth about his past, Naruto battles legendary ninjas, discovers the origins of the shinobi world, and prepares for his ultimate destiny as the Child of Prophecy.",
      "notes": "8.6"
    },
    {
      "title": "bleach",
      "image": "bleach",
      "release_date": "2004-10-05",
      "status": "Completed",
      "type": "Action, Supernatural, Fantasy",
      "description":
        "Ichigo Kurosaki gains the abilities of a Soul Reaper after meeting Rukia Kuchiki. With his new powers, he must protect humans from evil spirits known as Hollows and maintain balance between the human world and the afterlife. However, as Ichigo delves deeper into the Soul Society, he uncovers hidden conspiracies, powerful enemies, and the true nature of his own spiritual powers.",
      "notes": "8.2"
    },
    {
      "title": "sword-art-online",
      "image": "sword-art-online",
      "release_date": "2012-07-08",
      "status": "Completed",
      "type": "Action, Adventure, Fantasy",
      "description":
        "In the year 2022, thousands of players become trapped in the virtual reality MMORPG, Sword Art Online, where dying in the game means death in real life. Kirito, a skilled player, must navigate through deadly battles, form alliances, and clear 100 floors of Aincrad to escape the game. As he encounters powerful foes and emotional struggles, Kirito discovers the true meaning of strength, love, and survival.",
      "notes": "7.9"
    },
    {
      "title": "tokyo-ghoul",
      "image": "tokyo-ghoul",
      "release_date": "2014-07-04",
      "status": "Completed",
      "type": "Action, Supernatural, Horror",
      "description":
        "Ken Kaneki, a shy college student, barely survives a deadly encounter with a flesh-eating creature known as a Ghoul. After an emergency transplant, he discovers that he has become a half-Ghoul himself. Struggling with his new existence, Kaneki is taken in by the café 'Anteiku,' where he learns about Ghoul society, its factions, and the deep conflicts between humans and Ghouls. As he battles his own hunger and morality, he becomes involved in a war between the CCG (anti-Ghoul investigators) and the dangerous Ghoul organizations that threaten the city's peace.",
      "notes": "7.9"
    },
    {
      "title": "hunter-x-hunter",
      "image": "hunter-x-hunter",
      "release_date": "2011-10-02",
      "status": "Hiatus",
      "type": "Action, Adventure, Fantasy",
      "description":
        "Gon Freecss dreams of becoming a legendary Hunter, an elite adventurer capable of discovering hidden treasures, rare creatures, and even hunting criminals. However, his true goal is to find his estranged father, who abandoned him to pursue his own path as a Hunter. Alongside his friends Killua, Kurapika, and Leorio, Gon embarks on a journey that takes him through dangerous tests, life-threatening battles, and encounters with powerful enemies such as the Phantom Troupe and the Chimera Ants. Each challenge brings him closer to uncovering his own potential and the truth behind the Hunter world.",
      "notes": "9.0"
    },
    {
      "title": "demon-slayer",
      "image": "demon-slayer",
      "release_date": "2019-04-06",
      "status": "Ongoing",
      "type": "Action, Supernatural, Fantasy",
      "description":
        "Tanjiro Kamado, a kind-hearted boy, lives a peaceful life with his family until they are brutally slaughtered by demons. The sole survivor, his younger sister Nezuko, is transformed into a demon but retains some of her human emotions. Determined to avenge his family and cure Nezuko, Tanjiro joins the Demon Slayer Corps, an elite group dedicated to hunting demons. As he masters breathing techniques and fights formidable foes, he uncovers the origins of demons and the powerful Twelve Kizuki, led by the sinister Muzan Kibutsuji.",
      "notes": "8.9"
    },
    {
      "title": "fairy-tail",
      "image": "fairy-tail",
      "release_date": "2009-10-12",
      "status": "Completed",
      "type": "Action, Adventure, Fantasy",
      "description":
        "In the kingdom of Fiore, magic is a fundamental part of everyday life, and powerful wizards join guilds to take on missions. Lucy Heartfilia, a celestial spirit mage, dreams of joining the legendary Fairy Tail guild. She meets Natsu Dragneel, a fire-breathing Dragon Slayer searching for his missing foster dragon father, Igneel. Together with their friends, they take on dangerous quests, battle dark guilds, and unravel secrets about dragons, the origins of magic, and the destiny of their world.",
      "notes": "7.8"
    },
    {
      "title": "black-clover",
      "image": "black-clover",
      "release_date": "2017-10-03",
      "status": "Ongoing",
      "type": "Action, Adventure, Fantasy",
      "description":
        "Asta and Yuno are orphans who dream of becoming the Wizard King, the strongest mage in the Clover Kingdom. However, in a world where magic is everything, Asta is born without any magical abilities. Through sheer determination and hard training, he obtains a mysterious anti-magic grimoire, allowing him to fight even the strongest wizards. Alongside Yuno, a prodigy with immense mana, Asta faces ruthless enemies, corrupt nobles, and the threat of demonic forces while striving to prove that he can surpass all expectations.",
      "notes": "8.1"
    },
    {
      "title": "blue-exorcist",
      "image": "blue-exorcist",
      "release_date": "2011-04-17",
      "status": "Ongoing",
      "type": "Action, Supernatural, Fantasy",
      "description":
        "Rin Okumura, a teenager raised by a priest, discovers that he is the son of Satan. After witnessing the brutal death of his adoptive father at the hands of demons, Rin decides to defy his demonic heritage by becoming an exorcist. With his newly awakened blue flames and a cursed sword that suppresses his true form, he joins True Cross Academy to train as an exorcist while keeping his identity a secret. However, dark forces conspire against him, testing his bonds, beliefs, and control over his demonic powers.",
      "notes": "7.5"
    },
    {
      "title": "re-zero",
      "image": "re-zero",
      "release_date": "2016-04-04",
      "status": "Ongoing",
      "type": "Fantasy, Psychological, Drama",
      "description":
        "Subaru Natsuki is suddenly transported to a fantasy world but quickly realizes he has no special powers—except for one: 'Return by Death,' which allows him to rewind time upon death. Trapped in a cycle of suffering, loss, and painful decisions, Subaru struggles to change fate and protect his loved ones, including the kind-hearted half-elf Emilia. Each reset reveals dark truths about the world, its hidden enemies, and the price of his power.",
      "notes": "8.4"
    },
    {
      "title": "steins-gate",
      "image": "steins-gate",
      "release_date": "2011-04-06",
      "status": "Completed",
      "type": "Sci-Fi, Psychological, Thriller",
      "description":
        "Rintarou Okabe, a self-proclaimed mad scientist, accidentally discovers time travel after modifying a microwave. What starts as a harmless experiment spirals into a series of tragic consequences as he becomes entangled in a conspiracy involving a powerful organization. With his friends’ lives on the line, Okabe must race against time, face devastating losses, and make impossible choices to alter fate. A gripping story of love, sacrifice, and the weight of scientific discovery.",
      "notes": "9.1"
    },
    {
      "title": "code-geass",
      "image": "code-geass",
      "release_date": "2006-10-06",
      "status": "Completed",
      "type": "Action, Mecha, Psychological",
      "description":
        "Lelouch vi Britannia, a prince of the Britannian Empire, gains the power of Geass, which allows him to command anyone to obey his orders. With this newfound ability, he adopts the masked identity of Zero and leads a rebellion against the oppressive Britannian rule in Japan. As his war escalates, Lelouch faces moral dilemmas, betrayals, and the true cost of power in his quest for justice and vengeance.",
      "notes": "9.0"
    },
    {
      "title": "fruits-basket-2019",
      "image": "fruits-basket-2019",
      "release_date": "2019-04-06",
      "status": "Completed",
      "type": "Drama, Romance, Supernatural",
      "description":
        "Tohru Honda, a kind-hearted girl, finds herself living with the mysterious Sohma family after losing her mother. She soon discovers that they are cursed: certain family members transform into animals of the Chinese Zodiac when hugged by the opposite sex. As she gets to know them, Tohru becomes determined to heal their emotional wounds and break the curse. Through heartwarming and heartbreaking moments, she helps them embrace their pasts and look forward to a hopeful future.",
      "notes": "8.9"
    }
  ]
  